app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "products".* FROM "products"   ORDER BY "products"."name" ASC
---
  def index
  @products = Product.all
  @products = Product.order(:name)

INSERT INTO "products" ("category", "created_at", "discription", "name", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category", "frutes"], ["created_at", "2014-09-29 06:55:19.360155"], ["discription", "vjndfknl"], ["name", "mengo "], ["quantity", "12kg"], ["updated_at", "2014-09-29 06:55:19.360155"]]
---
  def create
    @product = Product.new(product_params)
    respond_to do |format|
      if @product.save

UPDATE "products" SET "discription" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["discription", "vjndfknl v fdgv"], ["updated_at", "2014-09-29 06:56:07.554896"]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)